artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 300
      arrivalRate: 300
      name: Warm up
    - duration: 90
      arrivalRate: 600
      # rampTo: 200
      name: Ramp up load
    - duration: 120
      arrivalRate: 600
      name: Sustained load
scenarios:
  - flow:
    - get:
        url: "/"